name: "yolov8n"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 1, 3, 640, 640 ]
  }
]


# Dynamic batching disabled for fixed batch model
# dynamic_batching {
#   preferred_batch_size: [ 1, 2, 4, 8 ]
#   max_queue_delay_microseconds: 100
# }

# GPU instance
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]

# Optimization
optimization {
  cuda {
    graphs: true
    busy_wait_events: true
  }
}